class Hadeth {
  final int id;
  final String title;
  final String content;

  Hadeth({
    required this.id,
    required this.title,
    required this.content,
  });

  factory Hadeth.fromFile(int id, String content) {
    return Hadeth(
      id: id,
      title: "الحديث ${_numberToArabicWord(id)}",
      content: content,
    );
  }

  static String _numberToArabicWord(int number) {
    const words = [
      "الأول",
      "الثاني",
      "الثالث",
      "الرابع",
      "الخامس",
      "السادس",
      "السابع",
      "الثامن",
      "التاسع",
      "العاشر",
      "الحادي عشر",
      "الثاني عشر",
      "الثالث عشر",
      "الرابع عشر",
      "الخامس عشر",
      "السادس عشر",
      "السابع عشر",
      "الثامن عشر",
      "التاسع عشر",
      "العشرون",
      "الحادي والعشرون",
      "الثاني والعشرون",
      "الثالث والعشرون",
      "الرابع والعشرون",
      "الخامس والعشرون",
      "السادس والعشرون",
      "السابع والعشرون",
      "الثامن والعشرون",
      "التاسع والعشرون",
      "الثلاثون",
      "الحادي والثلاثون",
      "الثاني والثلاثون",
      "الثالث والثلاثون",
      "الرابع والثلاثون",
      "الخامس والثلاثون",
      "السادس والثلاثون",
      "السابع والثلاثون",
      "الثامن والثلاثون",
      "التاسع والثلاثون",
      "الأربعون",
      "الحادي والأربعون",
      "الثاني والأربعون",
      "الثالث والأربعون",
      "الرابع والأربعون",
      "الخامس والأربعون",
      "السادس والأربعون",
      "السابع والأربعون",
      "الثامن والأربعون",
      "التاسع والأربعون",
      "الخمسون",
    ];
    if (number <= words.length) {
      return words[number - 1];
    }
    return number.toString();
  }
}
